app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find_by(id:params[:id])